#include "hc595.h"

//共阴数码管段码表
 unsigned char code DispCode[]={0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F,																			
                          //      0    1    2    3    4    5   6    7    8    9   
																0x77,0x7C,0x39,0x5E,0x79,0x71,0x3D,0x76,0x74,0x30,	
													//      A	   b    C	   d	  E	   F   G	  H	   h	  I   	
																0x10,0x1E,0x38,0x54,0x5C,0x73,0x67,0x50,0x31,0x78,
													//      i    J    L	   n    o	   P   q	  r    R	  t     	
																0x3E,0x1C,0x40,0x48,0x08,0x00};
													//      U	   V   一    二	  _    灭
//显示缓冲区
unsigned char DispBuf[8];
																
/***********************************************
函数名称：HC595_Delayms
功    能：STC 1T单片机1ms延时程序
入口参数：ms:延时的毫秒数
返 回 值：无	
备    注：示波器实测1.05ms 时钟11.0592MHz
************************************************/
void HC595_Delayms(unsigned int ms)
{
  unsigned int i;
  while( (ms--) != 0)
  {
    for(i = 0; i < 600; i++); 
  }             
}																
/***********************************************
函数名称：HC595_SendWord
功    能：HC595发送两个字节数据。
入口参数：dat:显示的字型码
					dig:点亮的数码管位 dig中为0的位，则对应的数码管点亮
          例如:dig=0x1111 1110,将dig送入U3芯片HC595后，最低位的0数据
          将出现在原理图的Q0管脚，则该脚对应的数码管点亮，其他数码管熄灭。
返 回 值：无	
备    注：两片HC595，发送两个字节数据，高字节
          为数码管段码，低字节为选择点亮哪个数码管。
					该程序点亮数码管可以结合原理图来看，
					否则不好理解，和电路原理关系密切。
************************************************/
void HC595_SendWord(unsigned char dat,unsigned char dig)
{
	unsigned char i;	       //定义计数器
	unsigned int temp=0;	   //定义数据变量
	//将两个8位变量合并成一个16字节变量
	temp=dat;
	temp=temp<<8  | dig;
	//送出数据
	for(i=0;i<16;i++)		 	
  {				
		HC595_SCK_Clr();	     //置低时钟线
		
		if( (temp&0x8000)==0x8000 )//先发送高字节
	 	{
	   	HC595_DAT_Set();	   //置高信号线
	 	}
	 	else
	 	{
			HC595_DAT_Clr();	   //置低信号线
	 	}	
		HC595_SCK_Set();		   //置高时钟线
		
	  temp<<=1;				   		 //数据左移				
	}
	//锁存信号上升沿锁存数据 数据输出到端口			
	HC595_RCK_Clr();		 	
	HC595_RCK_Set();		
} 
/***********************************************
函数名称：LED_Display
功    能：数码管显示函数
入口参数：无
返 回 值：无	
备    注：无
************************************************/
void LED_Display(void)
{
  unsigned char i;	
  for(i=0;i<8;i++)
	{	
		//将待显示的字型码和点亮的数码管位送至HC595。
		//由于是共阴数码管，将八段数码管共阴极拉低，显示数据。
		//DispBuf[i]:为显示的内容
		//DispCode[DispBuf[i]:为将显示的内容转换成对应的字形码
		//数码管按字形码显示出来就是我们看到的显示内容
		
		//~(0x01<<i),当i=0时等价于:0x1111 1110 当i=1时等价于：0x1111 1101
		//以此类推，依次有一位为0，为0的位对应的数码管点亮
	
		HC595_SendWord(DispCode[DispBuf[i]],(~(0x01<<i)));	
		
		HC595_OE_Clr();				  //打开显示
		HC595_Delayms(1);				//适当延时      
		HC595_OE_Set();				  //关闭显示
	} 	 
}	
/***********************************************
函数名称：ToDisplayCorrect
功    能：把正确信息放入显示缓冲区
入口参数：无
返 回 值：无	
备    注：在数码管中显示CorrEct :正确的意思
************************************************/
void ToDisplayCorrect(void)
{
	DispBuf[0]=35;			//DispCode[35]:熄灭
	DispBuf[1]=12;			//DispCode[12]:C
	DispBuf[2]=24;			//DispCode[24]:o
	DispBuf[3]=27;			//DispCode[27]:r
	DispBuf[4]=27;			//DispCode[27]:r
	DispBuf[5]=14;		 	//DispCode[14]:E
	DispBuf[6]=12;	 		//DispCode[12]:C
	DispBuf[7]=29;		 	//DispCode[29]:t
}
/***********************************************
函数名称：ToDisplayError
功    能：把错误信息放入显示缓冲区
入口参数：无
返 回 值：无	
备    注：在数码管中显示Error :错误的意思
************************************************/
void ToDisplayError(void)
{
	DispBuf[0]=35;			//DispCode[35]:熄灭
	DispBuf[1]=35;			//DispCode[35]:熄灭
	DispBuf[2]=35;		 	//DispCode[35]:熄灭
	DispBuf[3]=14;			//DispCode[14]:E
	DispBuf[4]=27;			//DispCode[35]:r
	DispBuf[5]=27;			//DispCode[35]:r
	DispBuf[6]=24;			//DispCode[24]:o
	DispBuf[7]=27;			//DispCode[35]:r
}
/***********************************************
函数名称：HC595_Clear
功    能：清除显示函数
入口参数：无
返 回 值：无	
备    注：无
************************************************/
void HC595_Clear(void)
{	
	unsigned char i;
	//清除显示缓冲区内容
	for(i=0;i<8;i++)
	{
		//35为DispCode[35]中定义的数码管熄灭的字形码
		DispBuf[i]=35;
	}
	
	//数据0x00为字形码，0xff为数码管位码
	//由原理图可知该开发板使用共阴极数码管
	//共阴极数码管特点是字形码端高电平，位码端低电平，数码管才能点亮
	//现在发送的字形码全为低电平，位码全为高电平，所以全部熄灭
	HC595_SendWord(0x00,0xff);			  
}
/***********************************************
函数名称：HC595_Init
功    能：显示初始化函数
入口参数：无
返 回 值：无	
备    注：无
************************************************/
void HC595_Init(void)
{	
	//等待HC595上电稳定
	HC595_Delayms(10);				
	
	//初始化P41,P42,P45口为准双向口
	P4M1 &=~( (1<<1) | (1<<2) | (1<<5));  
	P4M0 &=~( (1<<1) | (1<<2) | (1<<5)); 
	
	//初始化P37口为准双向口
	P3M1 &=~(1<<7);  
	P3M0 &=~(1<<7); 

	//分析
	//  1<<0等价于0x01 即 0000 0001
	//  1<<1等价于0x02 即 0000 0010
	//  1<<2等价于0x04 即 0000 0100
	//  1<<3等价于0x08 即 0000 1000
	//  以此类推1<<n 即第n位为1，其余位是0

	//  x |=(1<<n)  即对x执行按位取或 
	//  即x中的第n位置为1，不改变其他位状态  
	
	//  y &=~(1<<n)  即将1<<n按位取反，然后对y按位取与 
	//  即y中的第n位置为0，不改变其他位状态 
	
	//将端口置低，赋予端口固定电平
	HC595_DAT_Clr();
	HC595_SCK_Clr();
	HC595_RCK_Clr();
	//关闭显示
	HC595_OE_Set();		
	//清除显示内容
	HC595_Clear();	
}